In [1]:
import pandas as pd

#### Pandas Series and their basic attributes

In [2]:
data = pd.Series([0.25, 0.5, 0.75, 1.0], index=['a', 'b', 'c', 'd'])

In [3]:
data.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [4]:
type(data.index)

pandas.core.indexes.base.Index

In [5]:
data.values

array([0.25, 0.5 , 0.75, 1.  ])

In [6]:
type(data.values)

numpy.ndarray

#### Indexing and slicing

In [7]:
print(data['b'])
print('\n')
print(data['a':'c'])
print('\n')
print(data.values[2])

0.5


a    0.25
b    0.50
c    0.75
dtype: float64


0.75

#### We can create a Pandas Series starting froma an ordinary dictionary

In [8]:
grads_dict = {'A': 4, 'B': 3.5, 'C': 3, 'D': 2.5}
grads = pd.Series(grads_dict)

In [9]:
grads.values

array([4. , 3.5, 3. , 2.5])

In [10]:
grads.index

Index(['A', 'B', 'C', 'D'], dtype='object')

Pay attention on different handling of slicing

In [11]:
grads[0:2] #implicit indices

A    4.0
B    3.5
dtype: float64

In [12]:
grads['A':'C'] #explicit indices

A    4.0
B    3.5
C    3.0
dtype: float64

In [13]:
2 * grads[0:2]

A    8.0
B    7.0
dtype: float64

#### Pandas DataFrame

In [14]:
brands_dict = {'Car1': 'Volkswagen', 'Car2': 'Nissan'}
brands = pd.Series(brands_dict)
models_dict = {'Car1': 'Tiguan', 'Car2': 'Quasquai'}
models = pd.Series(models_dict)
years_dict = {'Car1': 2008, 'Car2': 2011}
years = pd.Series(years_dict)
kilometers_dict = {'Car1': 101000,'Car2': 120000}
kilometers = pd.Series(kilometers_dict)

In [15]:
cars = pd.DataFrame({'Brand': brands, 'Model': models, 'Year': years, 'Kilometers': kilometers})

In [16]:
cars

           Brand     Model  Year  Kilometers
Car1  Volkswagen    Tiguan  2008      101000
Car2      Nissan  Quasquai  2011      120000

In [17]:
cars.T

                  Car1      Car2
Brand       Volkswagen    Nissan
Model           Tiguan  Quasquai
Year              2008      2011
Kilometers      101000    120000

In [18]:
cars.values

array([['Volkswagen', 'Tiguan', 2008, 101000],
       ['Nissan', 'Quasquai', 2011, 120000]], dtype=object)

In [19]:
type(cars.values)

numpy.ndarray

In [20]:
cars.values.shape

(2, 4)

In [21]:
cars.values[0,1]

'Tiguan'

In [22]:
cars.columns

Index(['Brand', 'Model', 'Year', 'Kilometers'], dtype='object')

In [23]:
type(cars.columns)

pandas.core.indexes.base.Index

In [24]:
cars.columns[2]

'Year'

In [25]:
cars['Km/yr'] = cars['Kilometers'] / (2022 - cars['Year'])

In [26]:
cars

           Brand     Model  Year  Kilometers         Km/yr
Car1  Volkswagen    Tiguan  2008      101000   7214.285714
Car2      Nissan  Quasquai  2011      120000  10909.090909

In [27]:
recent_cars = cars[cars['Year'] > 2009]

In [28]:
recent_cars

       Brand     Model  Year  Kilometers         Km/yr
Car2  Nissan  Quasquai  2011      120000  10909.090909

Modifying an entry of a dataframe

In [29]:
cars.loc[cars.index[0],'Model'] = 'Golf'
cars

           Brand     Model  Year  Kilometers         Km/yr
Car1  Volkswagen      Golf  2008      101000   7214.285714
Car2      Nissan  Quasquai  2011      120000  10909.090909

In [31]:
cars.loc[:,'Brand'] = ['Opel', 'Renault']
cars

        Brand     Model  Year  Kilometers         Km/yr
Car1     Opel      Golf  2008      101000   7214.285714
Car2  Renault  Quasquai  2011      120000  10909.090909